app/views/comments/_form.html.erb

<%= form_for(@comment, :html => { :class => 'form-horizontal'})  do |comment| %>
  <%= comment.collection_select :receiver_id, User.all, :id, :name %>
  <%= comment.select :category, options_for_category_select %>
---
SELECT "users".* FROM "users"
SELECT "categories".* FROM "categories"