app/controllers/categories_controller.rb

  def create
    # 중복검사
    result = 1

    if Category.where(:name => params[:name]).blank?
      category = Category.new(:name => params[:name])
      if category.save!
---
SELECT "categories".* FROM "categories" WHERE "categories"."name" = '무기력'
INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Sun, 12 Jan 2014 04:10:23 KST +09:00], ["name", "ㅁㄴㄹㅁㄴㄹ"], ["updated_at", Sun, 12 Jan 2014 04:10:23 KST +09:00]]