app/controllers/comments_controller.rb

SELECT "comments".* FROM "comments" ORDER BY "comments"."updated_at" ASC
---
  def index
    @comment = Comment.new
    @comments = Comment.all

INSERT INTO "comments" ("category", "content", "created_at", "receiver_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["category", "1"], ["content", "카테고리추가"], ["created_at", Sun, 05 Jan 2014 04:03:37 UTC +00:00], ["receiver_id", 1], ["updated_at", Sun, 05 Jan 2014 04:03:37 UTC +00:00], ["user_id", 1]]
---
  def create
    @comment = Comment.new
    @comment.user_id = session[:user_id]
    @comment.content = params[:comment][:content]
    @comment.receiver_id = params[:comment][:receiver_id]
    @comment.category = params[:comment][:category]
    @comment.save!